org/controls.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Awkward Controls</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="src/bigblow_theme/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="death.css" />
<meta content="Eclipse: Awkward controls" property="og:title" />
<meta content="HELP! OH GOD HELP! HOW DO I PLAY THIS GAME" property="og:description" />
<meta content="https://death.town/~corpse/controls.html" property="og:url" />
<meta content="https://death.town/~corpse/images/sotla.png" property="og:image" />
<meta content="#FF0000" data-react-helmet="true" name="theme-color" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Awkward Controls</h1>

<p>
The Eclipse features a vast array of controls designed to offer freedom in action to the player. While these controls may seem complicated, they were not made by an ape.
</p>

<p>
The Eclipse's controls are deliberately strange (and obtuse, to a degree) in order to defamiliarize Garry's Mod players with the gameplay mechanics.
</p>

<p>
<a href="./index.html">TAKE ME BACK</a>
</p>
<div id="outline-container-org871a216" class="outline-2">
<h2 id="org871a216">COORDINATION</h2>
<div class="outline-text-2" id="text-org871a216">
<ul class="org-ul">
<li><code>MOUSE_X</code> / <code>MOUSE_Y</code>: Turn your head.</li>
<li><code>KEY_W</code> / <code>KEY_A</code> / <code>KEY_S</code> / <code>KEY_D</code>: Forward/left/back/right.
<ul class="org-ul">
<li>+ <code>SHIFT</code>: Alter movement speed.</li>
</ul></li>
<li><code>SHIFT</code> + <code>MOUSE_WHEEL</code>: While holding shift, adjusts your speed.</li>
<li><code>KEY_B</code>: Behold the thing you're looking at. Works on things, bodies and players.</li>
</ul>
</div>
</div>

<div id="outline-container-org3dbe4cb" class="outline-2">
<h2 id="org3dbe4cb">POSTURE</h2>
<div class="outline-text-2" id="text-org3dbe4cb">
<ul class="org-ul">
<li>Press <code>CTRL</code>: Toggle crouch.
<ul class="org-ul">
<li>Press <code>KEY_SPACE</code> while crouching: Toggle prone.</li>
<li>Hold <code>KEY_SPACE</code> while crouching: Prone until release.</li>
</ul></li>
<li>Hold <code>CTRL</code>: Crouch until release.
<ul class="org-ul">
<li><code>KEY_SPACE</code> interacts the same way.</li>
</ul></li>
<li><code>KEY_T</code>: Tumble.</li>
</ul>
</div>
</div>

<div id="outline-container-org6d0d0ec" class="outline-2">
<h2 id="org6d0d0ec">THINGS AND STUFF</h2>
<div class="outline-text-2" id="text-org6d0d0ec">
<ul class="org-ul">
<li><code>MOUSE_LEFT</code> without held item: Pick things up.</li>
<li><code>MOUSE_LEFT</code> with held item: Use on somebody or something else.</li>
<li><code>MOUSE_MIDDLE</code> with held item: Use by itself.
<ul class="org-ul">
<li>Eating something.</li>
<li>Pulling the pin on a grenade.</li>
<li>Injecting yourself with a syringe full of dangerous drugs.</li>
</ul></li>
<li><code>KEY_C</code> with two held items: Combine.
<ul class="org-ul">
<li>Pouring soup from a pot to a bowl.</li>
<li>Putting a magazine in a gun.</li>
<li>Shoving a rock on the end of a rebar club.</li>
</ul></li>
<li><code>KEY_C</code> with one held item: Decombine.
<ul class="org-ul">
<li>Removing a magazine from a gun</li>
<li>Taking a pill out of a bottle.</li>
<li>Removing the charge from a bomb.</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org6524587" class="outline-3">
<h3 id="org6524587">WHIPPING IT OUT</h3>
<div class="outline-text-3" id="text-org6524587">
<ul class="org-ul">
<li><code>KEY_H</code> with held item: Holster.</li>
<li><code>KEY_H</code> without held item: Unholster.</li>
<li><code>KEY_X</code> <code>KEY_1</code> to <code>KEY_4</code> with held item in right hand: Put item in right hand into pocket.</li>
<li><code>KEY_X</code> + <code>KEY_1</code> to <code>KEY_4</code> without held item in right hand: Put item from right hand into pocket.</li>
<li><code>KEY_Z</code> + <code>KEY_1</code> to <code>KEY_4</code> with held item in left hand: Put item in left hand into pocket.</li>
</ul>
<p>
~ <code>KEY_z</code> + <code>KEY_1</code> to <code>KEY_4</code> without held item in left hand: Put item from left hand into pocket
</p>
</div>
</div>
<div id="outline-container-org7dcb9b8" class="outline-3">
<h3 id="org7dcb9b8">LETTING GO</h3>
<div class="outline-text-3" id="text-org7dcb9b8">
<ul class="org-ul">
<li><code>KEY_X</code>: Drop item from your primary hand.</li>
<li>Hold <code>KEY_X</code> + <code>MOUSE_LEFT</code>: Place item from your primary hand on your crosshair.</li>
<li>Hold <code>KEY_C</code> + <code>MOUSE_LEFT</code>: Throw item from your primary hand.</li>
<li><code>KEY_R</code>: Swap held items between hands.</li>
<li><code>KEY_Z</code>: Drop item from your offhand.</li>
<li>Hold <code>KEY_Z</code> + <code>MOUSE_LEFT</code>: Place item from your offhand on your crosshair.</li>
<li>Hold <code>KEY_X</code> + <code>MOUSE_LEFT</code>: Throw item from your offhand.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org40b52ad" class="outline-2">
<h2 id="org40b52ad">FRIENDLY INTERACTION</h2>
<div class="outline-text-2" id="text-org40b52ad">
<ul class="org-ul">
<li>Hold <code>MOUSE_RIGHT</code>: Prime for attack.
<ul class="org-ul">
<li>+ <code>MOUSE_LEFT</code>: Swing your fists/weapon.</li>
</ul></li>
<li><code>KEY_SPACE</code>: Shove with one hand.
<ul class="org-ul">
<li>+ <code>MOUSE_RIGHT</code>: Shove with both hands.</li>
</ul></li>
<li><code>SHIFT</code> + <code>KEY_SPACE</code>: Kick.
<ul class="org-ul">
<li>While looking down: Stomp.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf97964e" class="outline-2">
<h2 id="orgf97964e">COMMUNICATION</h2>
<div class="outline-text-2" id="text-orgf97964e">
<ul class="org-ul">
<li><code>KEY_Y</code>: Open chatter.</li>
</ul>
</div>
<div id="outline-container-org9186cf4" class="outline-3">
<h3 id="org9186cf4">WHILE THE CHATTER IS OPEN</h3>
<div class="outline-text-3" id="text-org9186cf4">
<ul class="org-ul">
<li><code>KEY_A</code> to <code>KEY_Z</code>: Input characters.</li>
<li><code>KEY_BACKSPACE</code>: Delete ending character.
<ul class="org-ul">
<li>With no text: Close chatter.</li>
</ul></li>
<li><code>KEY_ENTER</code>: Speak your words.
<ul class="org-ul">
<li>With no text: Close chatter.</li>
</ul></li>
<li><code>KEY_CAPSLOCK</code>: Toggle caps lock.
<ul class="org-ul">
<li>Because of how the chatter is rendered, which allows you to use your mouse while it's open, it is not possible for the game to detect the status of Caps Lock on the user's keyboard.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
